Конфигурация/src/Documents/ОплатаКлиентом/ОплатаКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаКлиентом</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ВзаиморасчетыСКлиентами/ВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКлиентами</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ОплатаКлиентом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
    
    // Проверка заполнения и суммы
    Если Клиент.Пустая() Тогда
        Отказ = Истина;
        Сообщить("Не указан Клиент.");
        Возврат;
    КонецЕсли;
    
    Если ЭтотОбъект.Сумма <= 0 Тогда
        Отказ = Истина;
        Сообщить("Сумма оплаты должна быть больше нуля.");
        Возврат;
    КонецЕсли;
    
    // Создаем движение
    Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
    Движение.Период      = Дата;
    Движение.Клиент      = Клиент;
    // Оплата уменьшает общую задолженность клиента, регистрируется как Приход по регистру
    Движение.СуммаДолга  = Сумма;
    
КонецПроцедуры
